# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8n model with a custom, smaller FPN/PAN neck for a single class.

# Parameters
nc: 1  # number of classes - IMPORTANT: Set to 1 for 'vehicles'
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25  # layer channel multiple
# anchors: ... (will be handled by the trainer)

# YOLOv8.0n backbone
backbone:
  # [from, number, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 1, C2f, [128, True]]  # 2
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 2, C2f, [256, True]]  # 4
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 2, C2f, [512, True]]  # 6 (we will use this output for our FPN)
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 1, C2f, [1024, True]]  # 8
  - [-1, 1, SPPF, [1024, 5]]   # 9 (we will use this output for our FPN)

# Custom YOLOv8.0n head (Neck + Detection)
# A smaller FPN+PAN structure
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 10: Upsample from SPPF output
  - [[-1, 6], 1, Concat, [1]] # 11: Concat with output from layer 6 (C2f)
  - [-1, 1, C2f, [512, False]] # 12: FPN fusion block (P4 output)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 13: Upsample from P4
  - [[-1, 4], 1, Concat, [1]] # 14: Concat with output from layer 4 (C2f)
  - [-1, 1, C2f, [256, False]] # 15: FPN fusion block (P3 output, this will be our first detection head input)

  - [-1, 1, Conv, [256, 3, 2]] # 16: Downsample for PAN path
  - [[-1, 12], 1, Concat, [1]] # 17: Concat with P4 features from layer 12
  - [-1, 1, C2f, [512, False]] # 18: PAN fusion block (N4 output, this will be our second detection head input)

  - [-1, 1, Conv, [512, 3, 2]] # 19: Downsample for PAN path
  - [[-1, 9], 1, Concat, [1]] # 20: Concat with P5 features from layer 9 (SPPF)
  - [-1, 1, C2f, [1024, False]] # 21: PAN fusion block (N5 output, this will be our third detection head input)

  - [[15, 18, 21], 1, Detect, [nc]]  # Detect(P3, P4, P5)